随着认识越来越深越来越全面，我也越来越爱这个魔鬼。最终我明白，原来它就是生命力自身

我们社会的各种制度建设，也包括以儒家为主的思想文化，在我看来，其实都是在试着去压制这个魔鬼。之所以如此，是因为我们惧怕巨婴们心中都住着的这个魔鬼。但是，本能上我们喜欢走的路，是注定走不通的。
这只能暂时克制其破坏性，但同时也损害了活力和创造力。

儒家之所以能成为我们的主流文化，它的合理之处就在于此。全能自恋的能量太强了，所以
要设计一套非常烦琐的体系，来压制它。并且，必须将所有的龙们，都统一到一个思想中。因
为，如果思想不统一，就容易出现你死我活的分裂与斗争。

用精神分析的话来讲，原始的生命力都是带着攻击性的，一个人必须将他带着攻击性的生命
力展现在关系中，以此和另外一个同样如此真实的人建立关系，然后才能得到亲密，并被救赎。

"未经省察的人生没有价值" ---苏格拉底


口欲期 单纯、单一对象、追求快感、用嘴来体验
肛欲期 控制与强迫，追求洁净和秩序
俄狄浦斯期 接受关系的复杂性、

夫妻关系在一个家庭和家族中，是要第一位的，而亲子关系要列在第二位。并且，夫妻间有深厚的情感，他们的情感链接的质量，可以在家中起到定海神针的作用

一个焦虑的母亲，一个缺席的父亲，和一个有问题的孩子

婚后，因没有感情的滋养，也因为重男轻女令女性严重缺乏安全感，导致妻子一方怕孤独，
于是去抓丈夫，控制丈夫，而丈夫觉得，本来就缺感情基础，更不愿被妻子紧紧抓住，那会让他
重温幼时被妈妈吞没的噩梦，所以丈夫要选择逃走，逃走的方式可以是工作、爱好，或者其他女
人。

妻子感觉到更加孤独无助，但她越抓，男人跑得越远。等有了孩子后，妻子终于发现，孩子
可以在极大程度上弥补她内心的空洞，于是，她开始抓孩子。并且，最好是个儿子，那么，儿子
不仅弥补了情感空洞，还在相当程度上弥补了情欲的空洞。异性相吸，在母子间一样存在。结
果，妈妈会把儿子抓得更紧。
儿子被妈妈抓很紧，那女儿呢？如果妈妈内心比较健康，则可能会有同样待遇，也会被妈妈
抓住，但若是一个重男轻女的家庭，则女儿容易成为妈妈的“被讨厌的内在小女孩”的投射对
象，被妈妈厌恶乃至虐待。于是，造就了一个同样没有安全感甚至内心空洞更大的女性。

以控制开始的婚姻，必然有反抗和背叛，权力的本质是控制，权力和控制的对立面，是爱与自由。

当时，这位分析师问我：你认为中国家庭中父亲普遍缺席，那么，父亲去哪儿了？我想了想
回答，或者高高在上如皇帝，或者被阉了。
紫禁城的皇宫中，皇帝，即没有被阉割的成年雄性，只有一个。一个个的小家，由妃子和孩
子组成，公公则穿插其中。皇帝与太监们，组成了皇宫内的权力体系，而妃子与孩子，组成了一
个个小家的结构。

一个真正的男人，他需要能保护自己的家庭，也在家庭
中真切存在着，这竟然成了一个如此有价值的图景。男人们蝇营狗苟，拼命在社会权力体系上攀
爬时，为的是争到那个唯一的皇帝位置，或者有很多象征含义的家长位，也即有权力保障的交配
位，这真是一种很可悲的存在方式，如同虫子般，而且它总是以无意识的方式存在着。

婆媳大战的实质，是女人们发现自己被排挤出社
会权力体系和家族权力体系，她们必须将自己镶嵌在一个男人身上，以此嵌进社会权力体系，特
别是家族权力体系中。

中国的儒家传统以及社会权力体系，都是过度限制性的，所以我们也一直缺创造力。但我们
又是文明化的、超勤奋的，所以我们一直都有很好的模仿力。

美国神话学家约瑟夫·坎贝尔说，一个完整的生命即是一个英雄之旅，完成了这个旅程的
人，最后会发现，外部世界的善与恶，和自己内心的善与恶，是一回事。

考试梦的寓意：你遇到了考验

一环扣一环，生命的价值在一堆看似高尚的选择中指向终极的虚空。

一切为了孩子，这句话也可以说“一切都是为了繁殖”


哥哥问弟弟：杀死一个小女孩，可令整个世界得救，那么，这可以做吗？
弟弟犹豫了一会儿，小声但坚定地回答说：不可以！
这才是个人主义的真正精髓——不得以任何集体的任何名义侵占个人的利益。

集体主义，也是一种混沌未分化状态。

精神分裂在大多数人眼中很可怕，但在一些思想家眼中具有美学、哲学上的积极意义，比如
荣格认为，在精神分裂的状态下，会有原始的人格碎片、原型涌现出来，展现出原始的神话剧
情，可生发出艺术的可能性。法国哲学家德勒兹认为，精神分裂这个概念可以对抗资本主义的宰
制。

中国社会，到底谁掌权？社会权力体系中，是男人掌权，最经典是皇帝，家族权力体系中，
却常是大母神掌权，而作为权力代表的男性大家长，也得听他妈的。所以说，中国虽然自古重男
轻女，但在家庭里实际上是母亲说了算。现在的状况也是如此，奶奶、姥姥掌权的现象太多。在
社会层面上，我们是男权社会，在家庭层面是母系社会，皇太后说了算。


中国式的男权社会为什么会偏重宣扬女性（宣扬母性的伟大、无私、奉献），是补偿？还是阴谋？枷锁？

每个孩子都得先完成心理上的弑母，才能从共生中走出来。

妖女在这个无害的男人构建的容器中修炼成人

为什么都要找妈？因为在婴儿期，我们得到的母爱质量普遍不怎么样，这导致我们内心里都
有一个匮乏的婴儿，而渴望再有一次机会，找到好的母爱，以治疗生命最早期的伤痛。

恋爱，是对童年早期经验的修正。

两个人都是在轮流扮演巨婴和全能妈，一会儿你是巨婴我是全能妈，一会儿
我是巨婴你是全能妈，都在全心全意考虑彼此，但同时，都感觉到对方沉重而脆弱，自己的发展
被绑住了。

养育孩子有三个阶段：
6个月，是共生期，我称为一个人的阶段，婴儿觉得和妈妈一体。
6个月到3岁，是分离与个性化期，两个人的阶段，我是我，你是你，我们在一起。
3岁后，是俄狄浦斯期，三个人的阶段，我是我，你是你，我们中间还有我们共同拥有的另一个人。

爱情的发展，也需要这三个阶段吧。的确有一个经典的爱情三阶段论：第一阶段，1+1=1，我
们是一个人；第二阶段，1+1=0，我的所有痛苦不幸都是因为你；第三阶段，1+1=2，我是我，你
是你，我们在一起。
第二阶段的憎恨很重要，活过这个阶段还能幸存，才进入第三阶段，是两颗独立的灵魂，彼
此相爱。
最后再说说安全感。关于安全感，国人容易有单一的物质化界定，比如房子、车子。没有房
子就不能结婚，所以有这样的说法——丈母娘推动了中国的房价。并且，国人也总是在劝那些在
婚姻关系中没有爱情的人，别贪心，不可能得到一切。但是，有一个基本的真相是，真正能够制
造安全感的只有爱。

中国女性虽然说起妈宝男来恨得牙痒痒，会发誓不和这种男人搅在一起，可这种男人
一开始有一种好处，对缺乏安全感的中国女人有致命吸引力——好控制。

若发现自己是巨婴，别谴责自己，慢慢认识自己，慢慢成长。
并且，巨婴和婴儿一样有可爱之处，因其在索求的时候，心在一定程度上是打开的。打开，
就意味着链接的可能性。巨婴的另一半，则常常是严重压抑了渴求的人，他们的心闭得更紧，严
重时，任何链接都不可能一般。

你为何会选择巨婴？很可能是，你心中也住着一个巨婴。

如伴侣或重要亲人是巨婴，这的确意味着很大的挑战。该怎么做？
适当满足——当你想满足的时候，尽可能给予高质量的回应——深深的理解和接纳，并带着
热情。同时，守住自己的界限，不要沦为对方的奴仆。巨婴真的会渴望伴侣做自己忠实的奴仆，我
听到很多人这样说过，譬如一个经典说法是，我有一个二十四孝男朋友或老公。
并且，无论如何，都要学习真实，以自己感觉为中心发展真自我，别太在这个关系中委屈自
己，否则最后会发现，这最不值得。

中国女人，最缺什么？答案是，安全感！
一个典型的中国女人，无论她外在看上去如何如何，都难以避免内在的安全感的匮乏。中国
男人的种种经典表现，其实都是围绕着女性的安全感来设计的。

安全感，是探索精神的基石。

他者即地狱。意思是，如果一个人不是主体，而是成了围绕着他人来转的他者，那他就是身处地狱中的。

崇拜加照顾，是搞定巨婴的绝招。照顾，弥补了巨婴们生命初期的缺憾，崇拜，则满足了巨婴们的全能自恋——婴儿早期都有无所不能的无边无际的自恋。
猪脑子+无微不至的照顾+当天神崇拜

S与M的转化，能精细到什么程度？偏S还是偏M，为什么？如何鉴定？





























