随着认识越来越深越来越全面，我也越来越爱这个魔鬼。最终我明白，原来它就是生命力自身

我们社会的各种制度建设，也包括以儒家为主的思想文化，在我看来，其实都是在试着去压制这个魔鬼。之所以如此，是因为我们惧怕巨婴们心中都住着的这个魔鬼。但是，本能上我们喜欢走的路，是注定走不通的。
这只能暂时克制其破坏性，但同时也损害了活力和创造力。

儒家之所以能成为我们的主流文化，它的合理之处就在于此。全能自恋的能量太强了，所以
要设计一套非常烦琐的体系，来压制它。并且，必须将所有的龙们，都统一到一个思想中。因
为，如果思想不统一，就容易出现你死我活的分裂与斗争。

用精神分析的话来讲，原始的生命力都是带着攻击性的，一个人必须将他带着攻击性的生命
力展现在关系中，以此和另外一个同样如此真实的人建立关系，然后才能得到亲密，并被救赎。

"未经省察的人生没有价值" ---苏格拉底


口欲期 单纯、单一对象、追求快感、用嘴来体验
肛欲期 控制与强迫，追求洁净和秩序
俄狄浦斯期 接受关系的复杂性、

夫妻关系在一个家庭和家族中，是要第一位的，而亲子关系要列在第二位。并且，夫妻间有深厚的情感，他们的情感链接的质量，可以在家中起到定海神针的作用

一个焦虑的母亲，一个缺席的父亲，和一个有问题的孩子

婚后，因没有感情的滋养，也因为重男轻女令女性严重缺乏安全感，导致妻子一方怕孤独，
于是去抓丈夫，控制丈夫，而丈夫觉得，本来就缺感情基础，更不愿被妻子紧紧抓住，那会让他
重温幼时被妈妈吞没的噩梦，所以丈夫要选择逃走，逃走的方式可以是工作、爱好，或者其他女
人。

妻子感觉到更加孤独无助，但她越抓，男人跑得越远。等有了孩子后，妻子终于发现，孩子
可以在极大程度上弥补她内心的空洞，于是，她开始抓孩子。并且，最好是个儿子，那么，儿子
不仅弥补了情感空洞，还在相当程度上弥补了情欲的空洞。异性相吸，在母子间一样存在。结
果，妈妈会把儿子抓得更紧。
儿子被妈妈抓很紧，那女儿呢？如果妈妈内心比较健康，则可能会有同样待遇，也会被妈妈
抓住，但若是一个重男轻女的家庭，则女儿容易成为妈妈的“被讨厌的内在小女孩”的投射对
象，被妈妈厌恶乃至虐待。于是，造就了一个同样没有安全感甚至内心空洞更大的女性。

以控制开始的婚姻，必然有反抗和背叛，权力的本质是控制，权力和控制的对立面，是爱与自由。

当时，这位分析师问我：你认为中国家庭中父亲普遍缺席，那么，父亲去哪儿了？我想了想
回答，或者高高在上如皇帝，或者被阉了。
紫禁城的皇宫中，皇帝，即没有被阉割的成年雄性，只有一个。一个个的小家，由妃子和孩
子组成，公公则穿插其中。皇帝与太监们，组成了皇宫内的权力体系，而妃子与孩子，组成了一
个个小家的结构。

一个真正的男人，他需要能保护自己的家庭，也在家庭
中真切存在着，这竟然成了一个如此有价值的图景。男人们蝇营狗苟，拼命在社会权力体系上攀
爬时，为的是争到那个唯一的皇帝位置，或者有很多象征含义的家长位，也即有权力保障的交配
位，这真是一种很可悲的存在方式，如同虫子般，而且它总是以无意识的方式存在着。

婆媳大战的实质，是女人们发现自己被排挤出社
会权力体系和家族权力体系，她们必须将自己镶嵌在一个男人身上，以此嵌进社会权力体系，特
别是家族权力体系中。

中国的儒家传统以及社会权力体系，都是过度限制性的，所以我们也一直缺创造力。但我们
又是文明化的、超勤奋的，所以我们一直都有很好的模仿力。

美国神话学家约瑟夫·坎贝尔说，一个完整的生命即是一个英雄之旅，完成了这个旅程的
人，最后会发现，外部世界的善与恶，和自己内心的善与恶，是一回事。

考试梦的寓意：你遇到了考验

一环扣一环，生命的价值在一堆看似高尚的选择中指向终极的虚空。

一切为了孩子，这句话也可以说“一切都是为了繁殖”


哥哥问弟弟：杀死一个小女孩，可令整个世界得救，那么，这可以做吗？
弟弟犹豫了一会儿，小声但坚定地回答说：不可以！
这才是个人主义的真正精髓——不得以任何集体的任何名义侵占个人的利益。

集体主义，也是一种混沌未分化状态。

精神分裂在大多数人眼中很可怕，但在一些思想家眼中具有美学、哲学上的积极意义，比如
荣格认为，在精神分裂的状态下，会有原始的人格碎片、原型涌现出来，展现出原始的神话剧
情，可生发出艺术的可能性。法国哲学家德勒兹认为，精神分裂这个概念可以对抗资本主义的宰
制。

中国社会，到底谁掌权？社会权力体系中，是男人掌权，最经典是皇帝，家族权力体系中，
却常是大母神掌权，而作为权力代表的男性大家长，也得听他妈的。所以说，中国虽然自古重男
轻女，但在家庭里实际上是母亲说了算。现在的状况也是如此，奶奶、姥姥掌权的现象太多。在
社会层面上，我们是男权社会，在家庭层面是母系社会，皇太后说了算。


中国式的男权社会为什么会偏重宣扬女性（宣扬母性的伟大、无私、奉献），是补偿？还是阴谋？枷锁？

每个孩子都得先完成心理上的弑母，才能从共生中走出来。

妖女在这个无害的男人构建的容器中修炼成人

为什么都要找妈？因为在婴儿期，我们得到的母爱质量普遍不怎么样，这导致我们内心里都
有一个匮乏的婴儿，而渴望再有一次机会，找到好的母爱，以治疗生命最早期的伤痛。

恋爱，是对童年早期经验的修正。

两个人都是在轮流扮演巨婴和全能妈，一会儿你是巨婴我是全能妈，一会儿
我是巨婴你是全能妈，都在全心全意考虑彼此，但同时，都感觉到对方沉重而脆弱，自己的发展
被绑住了。

养育孩子有三个阶段：
6个月，是共生期，我称为一个人的阶段，婴儿觉得和妈妈一体。
6个月到3岁，是分离与个性化期，两个人的阶段，我是我，你是你，我们在一起。
3岁后，是俄狄浦斯期，三个人的阶段，我是我，你是你，我们中间还有我们共同拥有的另一个人。

爱情的发展，也需要这三个阶段吧。的确有一个经典的爱情三阶段论：第一阶段，1+1=1，我
们是一个人；第二阶段，1+1=0，我的所有痛苦不幸都是因为你；第三阶段，1+1=2，我是我，你
是你，我们在一起。
第二阶段的憎恨很重要，活过这个阶段还能幸存，才进入第三阶段，是两颗独立的灵魂，彼
此相爱。
最后再说说安全感。关于安全感，国人容易有单一的物质化界定，比如房子、车子。没有房
子就不能结婚，所以有这样的说法——丈母娘推动了中国的房价。并且，国人也总是在劝那些在
婚姻关系中没有爱情的人，别贪心，不可能得到一切。但是，有一个基本的真相是，真正能够制
造安全感的只有爱。

中国女性虽然说起妈宝男来恨得牙痒痒，会发誓不和这种男人搅在一起，可这种男人
一开始有一种好处，对缺乏安全感的中国女人有致命吸引力——好控制。

若发现自己是巨婴，别谴责自己，慢慢认识自己，慢慢成长。
并且，巨婴和婴儿一样有可爱之处，因其在索求的时候，心在一定程度上是打开的。打开，
就意味着链接的可能性。巨婴的另一半，则常常是严重压抑了渴求的人，他们的心闭得更紧，严
重时，任何链接都不可能一般。

你为何会选择巨婴？很可能是，你心中也住着一个巨婴。

如伴侣或重要亲人是巨婴，这的确意味着很大的挑战。该怎么做？
适当满足——当你想满足的时候，尽可能给予高质量的回应——深深的理解和接纳，并带着
热情。同时，守住自己的界限，不要沦为对方的奴仆。巨婴真的会渴望伴侣做自己忠实的奴仆，我
听到很多人这样说过，譬如一个经典说法是，我有一个二十四孝男朋友或老公。
并且，无论如何，都要学习真实，以自己感觉为中心发展真自我，别太在这个关系中委屈自
己，否则最后会发现，这最不值得。

中国女人，最缺什么？答案是，安全感！
一个典型的中国女人，无论她外在看上去如何如何，都难以避免内在的安全感的匮乏。中国
男人的种种经典表现，其实都是围绕着女性的安全感来设计的。

安全感，是探索精神的基石。

他者即地狱。意思是，如果一个人不是主体，而是成了围绕着他人来转的他者，那他就是身处地狱中的。

崇拜加照顾，是搞定巨婴的绝招。照顾，弥补了巨婴们生命初期的缺憾，崇拜，则满足了巨婴们的全能自恋——婴儿早期都有无所不能的无边无际的自恋。
猪脑子+无微不至的照顾+当天神崇拜

S与M的转化，能精细到什么程度？偏S还是偏M，为什么？如何鉴定？


尊重你的感觉，哺育你的感受，成为你自己。


原来一直不能理解，为何上公交、进出电梯，一定要挤。看了《中国文化的深层结构》后才
明白，这种情形下，我们都将彼此视为非我，又因缺乏共情，非我就直接降成非人，可毫不理会
对方感受。
不理会对方感受，也是因为自己没有心，甚至对自己的感受也缺乏觉知和尊重。因为没有
心，中国人多像是橡皮人，必须找一个集体之心统一他们，让他们都归属于一个集体自我，这样
才能让社会安定。

莱茵说，符合社会想象系统的人，就是一个社会中所谓的正常人，背离这个系统的人，就会
被社会视为疯子、精神病。

现在才明白，这些全情去爱的人，是在追求婴儿时没被满足的共生感：我只有你你只有我，
生活一致思想统一，差异被消灭了，成长也被消灭了。
须知参差多态，乃幸福本源。罗素如是说。他们恰恰活成了对立面。

发帖者也引入了宏大的话题，很符合民间想象系
统。一是尽孝，二是贫困的个人与强势的大学，尤其是后一个宏大的话题，有相当的迷惑性。

讨好，本质上是一种防御

真正的好，是那种我存在你也存在，我爱你，因我有丰沛的爱，并且我
真不需要你回报，而你真回报时，我也坦然笑纳。

对别人好，可以赢得认可与尊重；但若想赢得亲密，只有一条路——真实和敞开。展现的真实后，让对方自主选择。

如何让家庭不再出产中国式好人？您对父母养育子女的建议是？
从三点下手：第一，在孩子最小的时候，特别是一岁前，给予无条件的爱，特别是妈妈，要
在情感上与孩子尽情地互动，和孩子经常有皮肤接触。这时的爱必然要伴随着亲密与互动，若无
亲密与互动，而只是非常紧张地照顾孩子的物质与安全需要，那么，孩子不会感觉到爱，他会觉
得，真实的自己是糟糕的、不值得爱的，他得成为另一个人才能被爱。第二，当孩子逐渐有能力
开始探索外部世界时，给孩子自由，让孩子按照他自己的感觉、声音去探索世界，让孩子知道，
他的内在是足以成为他行为的凭借的。相反，中国父母最常做的是，干涉孩子的任何一个选择，
要孩子听话，按照自己的来，成为父母眼中的好孩子。第三，特别重要的是，鼓励孩子的活力流
露，而活力有两个重要的表现，一个是创造力，一个是性。中国父母需要深刻学习，才能懂得尊
重孩子的活力与性能量的流动和表达。

对他们最好的事，或许是攻击他们，摧毁他们，这样才能破掉他们厚厚的壳，将内心
的悲伤、羞耻、绝望与孤独翻出来。

俄罗斯大文豪索尔仁尼琴说：每个人都是宇宙的中心。
犹太哲学家马丁·布伯说：你必须自己开始。假如你自己不以积极的爱去深入生存，假如你
不以自己的方式去揭示生存的意义，那么对你来说，生存就将依然是没有意义的。
巴菲特说，他生命中最有价值的教诲，是父亲一再对他说：尊重你自己的感觉，你越是别具
一格，别人就越喜欢对你说三道四，这时候你要做的就是，坚持你自己的感觉。
心理学家弗洛姆说：必须让他找到一条新的道路，激发他“促进生命”的热情，让他比以前
更能感觉到生命活力与人格完整，让他觉得活得更有意义。这是唯一的道路。
心理学家罗杰斯说：成为你自己！
心理学家马斯洛则说：自我实现。
在我看来，他们说的都是一回事，即，你必须也只能从你自己出发。每个人都是一个能量
体，你需要展开你的各种能量，与其他能量体建立链接，这份链接越饱满，你就越能发现，自身
的能量是好的，别人的能量也是好的，当这份链接达到极致，所谓证悟就会发生。

什么狗屁得道！不过是将自我阉割圣化了。网友“祝小波”说：本来是要开悟，但是太复杂
太困难了，干脆阉割了事，反正长得很像！
灵性修为很高的人，貌似有点全知全能；而精神分裂症患者，也有全知全能感。

对感情的信心，就是对整个世界的信心。拯救自己内在对情感的信心。

缺乏体验性的丰盛的链接，而去追求头脑链接时，易追求纯净。即，头脑要剥离掉各种鄙
俗。但鄙俗或许才是生命本身。和一女子谈到张爱玲那句话——生命是一袭华美的袍，爬满了虱
子。看着优雅的她，我突然明白，她的优雅即所谓华美的袍，而蚤子，即那些生命鄙俗的骚动，
才是生命自身。
头脑很容易追求二元对立，头脑会对事物进行评判、分等级、追求纯净或深刻。但若头脑能
安静下来，身心都呈打开状态，那么一个人可以和任何看似普通的事物建立链接。所以，大师们
常说：修行，就是该吃饭吃饭，该睡觉睡觉。

退行，是弗洛伊德发明的词汇，用来解释这一种心理现象：在相对高级的心理发展阶段，遭
遇了不可承受的挫折，于是退行到相对低级的早期心理发展阶段，寻求那一阶段的心理安慰。
经典的退行，如感受到焦虑时，狂吃东西，就是退行到母亲的乳汁里，寻找最早期的一种安
慰。
经典的退行，如感受到焦虑时，狂吃东西，就是退行到母亲的乳汁里，寻找最早期的一种安
慰。

一个人的生命能量流向两部分，一部分是自体，即自己，一部分是客体，即别人乃至整个世
界。美国心理学家科胡特说，你如何看待自体和客体，构成了四个等级。
最好的等级，是自信和热情。自信，即生命能量能自然地滋养自己，相信自己能做成想做
的，同时很靠谱；热情，即生命能量能流淌到其他人或事上，滋养对方。
其次的等级，是自大和对客体的理想化。自大，即觉得自己很了不起，但缺乏事实的支持，
不过还是有一些支持；理想化，即很容易把自己崇拜的人理想化，但不会觉得他是全能的神。
较差的等级，是疑病和宗教性的恐惧。疑病，是自体虚弱在身体上的一种表现。宗教性恐
惧，即，还能对客体产生一定好感，但总觉得好的客体严厉而苛刻，自己必须倾尽所有，才能获
得其认可。
最差的等级，是自恋妄想和被迫害妄想。自恋妄想，即觉得自己就是神，无所不能，这完全
缺乏现实基础；被迫害妄想，即觉得外部世界有一无所不能的超牛逼之人，构建了一个体系，系
统性地迫害自己，而这也缺乏现实基础。


对偏执所营造的虚幻的支撑感之需求，并非只存在于普通人，或所谓意志不坚定者的故事
上。任何人，一旦将某一外在事物视为教条，并不折不扣地遵从它，都可能会将自己置于盲从的
境地。

真正的思考都可能是麻烦而累人的，如果能有一些简单的法则可以依靠，该有多好。这就和
崇拜李阳一样，在自己的心中找到支撑是很不容易的，而信奉一个貌似坚定的人，则容易得多。
问题是，这都不可靠。
心外无物，心外无法。若要寻找真正的支撑，我们必须回到内在，回到自己的心。



共生期的后期，婴儿开始逐渐发现，妈妈和他不是一个人，而是另外一个人。并且，妈妈才
是那个强有力的人，他对自己生活的掌控感，其实来自妈妈的照料，而不是他的努力。
这就打破了他的全能神感。这时，他面临的是一个好妈妈还是坏妈妈就至关重要。如果他面
临的是坏妈妈，即他的生活基本上没有得到足够好的照料，那么他就不能低头，还要活在全能感
中——我才是掌控自己生活的那个人，我不能信任妈妈。
但如果他面前是好妈妈，那么他就愿意低头。低头的那一刻，他将全能感在一定程度上投射
到了妈妈身上。并且，因为妈妈基本上是爱他的，这份低头意味着安全和信任。
信任最初就是这样发生的。
所以说，在婴儿期没有和妈妈建立起依恋关系，允许自己变得无助而依恋妈妈的话，等成年
时再建立这个，会非常困难。太多成年人在恋爱上遇到大问题，原因在此——太难把自己交出
去。
所以，概括说，好的母婴关系，会让婴儿走出超自恋，依恋上母亲，这意味着，第一次将自
己交给另一个人。巨婴，则还执着于全能自恋，总想在关系中掌控对方，而不是依恋对方，这会
构成他们亲密关系的最大障碍。

文字写到这里，温尼科特大叔的暖男气质似乎变了，有了强烈的暗黑气质。

可以说，温尼科特，或任何一个不断探索人性奥秘的心理学家，他们所追寻的，主要不是心
理健康，而是认识人性自身。至于在这个认识过程中，到底会发生什么，会走到哪里，他们自己
并不知道。
至于温尼科特，传记作者写道：“他是曾经到达彼岸，也见识过彼岸的探险家。”


巨婴和真正的成年人最大的区别或许该是，巨婴觉得，我一发愿，事情就得立即按我的来，
否则就会感觉到挫败，成年人则知道，好好去投入，在时间上持续，在空间上延伸，事情会逐渐
朝你期待的方向发展。






















